Pandas - Missing data handling
==========================

In [ ]:
* Missing data is always a problem in real life scenarios.
* Areas like machine learning and data mining face sever issues in the accuracy of their model
* Predeictions because of poor quality of data caused by missing values
* in these areas, missing value treatment is a major point of focus to make their models are accurate and valid.

In [4]:
#using r in print before double quotation will convert the string into raw string. 

print("D:\Learning\nData science\DATA\MissingData.xlsx")

print(r"D:\Learning\nData science\DATA\MissingData.xlsx")

D:\Learning
Data science\DATA\MissingData.xlsx
D:\Learning\nData science\DATA\MissingData.xlsx

In [10]:
import pandas as pd

df=pd.read_excel(r"D:\Learning\Data science\DATA\MissingData.xlsx")

print(df)

print("\nchecking the null values\n")

print(df.isnull())
print()
print(df["Age"].isnull())
print()
print(df.isnull().sum())
print()
print("Salary column empty value count=",df["Salary"].isnull().sum())

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
2     Dhayalan  23.0      NaN  Developer           3       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
5       Sundar   NaN  30000.0  Developer           6       1
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
8       Prince  29.0  33000.0        NaN           9       1
9      Shanker  30.0  34000.0  Developer          10       1

checking the null values

    Name    Age  Salary  Department  Experience  Gender
0  False  False   False       False       False   False
1  False  False   False       False       False   False
2  False  False    True       False       False   False
3  False  False   False       False       False   False
4  False  False   False       False       False   False
5  False   True   False       False       False   False
6  False  False   False       False       False   False
7  False  False   False       False       False   False
8  False  False   False        True       False   False
9  False  False   False       False       False   False

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: Age, dtype: bool

Name          0
Age           1
Salary        1
Department    1
Experience    0
Gender        0
dtype: int64

Salary column empty value count= 1

In [12]:
print(df.notnull())
print()
print("Value count in each column\n",df.notnull().sum())
print()
print("Salary column values count=",df["Salary"].notnull().sum())

   Name    Age  Salary  Department  Experience  Gender
0  True   True    True        True        True    True
1  True   True    True        True        True    True
2  True   True   False        True        True    True
3  True   True    True        True        True    True
4  True   True    True        True        True    True
5  True  False    True        True        True    True
6  True   True    True        True        True    True
7  True   True    True        True        True    True
8  True   True    True       False        True    True
9  True   True    True        True        True    True

Value count in each column
 Name          10
Age            9
Salary         9
Department     9
Experience    10
Gender        10
dtype: int64

Salary column values count= 9

Cleaning or filling missing data:
============

In [ ]:
* pandas provides various methods for cleaning the missing values
* The .fillna function can "fill in" NA values with non-null data in a couple of ways, 
    which we have illustrated in the following sections.

In [16]:
import pandas as pd

df=pd.read_excel(r"D:\Learning\Data science\DATA\MissingData.xlsx")

print(df)

print()

print(df.fillna(value=0))

print()

x=df["Age"].fillna(value=0) #these three lines can be df["Age"]=df["Age"].fillin(value=0), just for understanding the dictionary
                            #this is given

print()
print(x)
print()

df["Age"]=x
df["Summa column"]=x # new column appending for testing

print(df)

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
2     Dhayalan  23.0      NaN  Developer           3       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
5       Sundar   NaN  30000.0  Developer           6       1
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
8       Prince  29.0  33000.0        NaN           9       1
9      Shanker  30.0  34000.0  Developer          10       1

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
2     Dhayalan  23.0      0.0  Developer           3       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
5       Sundar   0.0  30000.0  Developer           6       1
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
8       Prince  29.0  33000.0          0           9       1
9      Shanker  30.0  34000.0  Developer          10       1


0    21.0
1    22.0
2    23.0
3    24.0
4    25.0
5     0.0
6    27.0
7    28.0
8    29.0
9    30.0
Name: Age, dtype: float64

          Name   Age   Salary Department  Experience  Gender  Summa column
0      Sridevi  21.0  25000.0  Developer           1       0          21.0
1      Sathish  22.0  26000.0  Developer           2       1          22.0
2     Dhayalan  23.0      NaN  Developer           3       1          23.0
3         Teja  24.0  28000.0  Developer           4       1          24.0
4         Rani  25.0  29000.0  Developer           5       0          25.0
5       Sundar   0.0  30000.0  Developer           6       1           0.0
6        Deepa  27.0  31000.0  Developer           7       0          27.0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0          28.0
8       Prince  29.0  33000.0        NaN           9       1          29.0
9      Shanker  30.0  34000.0  Developer          10       1          30.0

In [ ]:
FillNA forward and backward:
    * usig the concepts of fulling in the ReIndexing chapter we will fill the missing values.

In [18]:
#method="pad" or method="ffill" will fill the previous values

import pandas as pd

df=pd.read_excel(r"D:\Learning\Data science\DATA\MissingData.xlsx")

print(df)

print()

print(df.fillna(method="pad"))

print()

print(df.fillna(method="ffill"))

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
2     Dhayalan  23.0      NaN  Developer           3       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
5       Sundar   NaN  30000.0  Developer           6       1
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
8       Prince  29.0  33000.0        NaN           9       1
9      Shanker  30.0  34000.0  Developer          10       1

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
2     Dhayalan  23.0  26000.0  Developer           3       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
5       Sundar  25.0  30000.0  Developer           6       1
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
8       Prince  29.0  33000.0  Developer           9       1
9      Shanker  30.0  34000.0  Developer          10       1

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
2     Dhayalan  23.0  26000.0  Developer           3       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
5       Sundar  25.0  30000.0  Developer           6       1
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
8       Prince  29.0  33000.0  Developer           9       1
9      Shanker  30.0  34000.0  Developer          10       1

In [19]:
#method="bfill" will fill the next value

import pandas as pd

df=pd.read_excel(r"D:\Learning\Data science\DATA\MissingData.xlsx")

print(df)

print()

print(df.fillna(method="bfill"))

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
2     Dhayalan  23.0      NaN  Developer           3       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
5       Sundar   NaN  30000.0  Developer           6       1
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
8       Prince  29.0  33000.0        NaN           9       1
9      Shanker  30.0  34000.0  Developer          10       1

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
2     Dhayalan  23.0  28000.0  Developer           3       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
5       Sundar  27.0  30000.0  Developer           6       1
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
8       Prince  29.0  33000.0  Developer           9       1
9      Shanker  30.0  34000.0  Developer          10       1

In [21]:
#.dropna will drop the row or column based on arguement axis=0 or 1

#method="pad" or method="ffill" will fill the previous values

import pandas as pd

df=pd.read_excel(r"D:\Learning\Data science\DATA\MissingData.xlsx")

print(df)

print()

print(df.dropna()) #default empty value row will get removed

print()

print(df.dropna(axis=0)) #remove the rows if any value in the row is null or empty

print()

print(df.dropna(axis=1)) #remove the columns if any value in the columns is null or empty

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
2     Dhayalan  23.0      NaN  Developer           3       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
5       Sundar   NaN  30000.0  Developer           6       1
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
8       Prince  29.0  33000.0        NaN           9       1
9      Shanker  30.0  34000.0  Developer          10       1

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
9      Shanker  30.0  34000.0  Developer          10       1

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
9      Shanker  30.0  34000.0  Developer          10       1

          Name  Experience  Gender
0      Sridevi           1       0
1      Sathish           2       1
2     Dhayalan           3       1
3         Teja           4       1
4         Rani           5       0
5       Sundar           6       1
6        Deepa           7       0
7  Jeyalakshmi           8       0
8       Prince           9       1
9      Shanker          10       1

In [24]:
# to find mean of age without null values

print("average of age without empty value: ",df["Age"].dropna(axis=0).mean())

average of age without empty value:  25.444444444444443

Replace missing or generic values:
=====

In [26]:
import pandas as pd

df=pd.read_excel(r"D:\Learning\Data science\DATA\MissingData.xlsx")

print(df)

df=df["Gender"].replace({0:"Female",1:"Male"})

print()
print(df)

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
2     Dhayalan  23.0      NaN  Developer           3       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
5       Sundar   NaN  30000.0  Developer           6       1
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
8       Prince  29.0  33000.0        NaN           9       1
9      Shanker  30.0  34000.0  Developer          10       1

0    Female
1      Male
2      Male
3      Male
4    Female
5      Male
6    Female
7    Female
8      Male
9      Male
Name: Gender, dtype: object

In [31]:
import pandas as pd

df=pd.read_excel(r"D:\Learning\Data science\DATA\MissingData.xlsx")

print(df)

df["Gender"]=df["Gender"].replace({0:"Female",1:"Male"})
df["Age"]=df["Age"].fillna(value="Empty")

print()
print(df)

          Name   Age   Salary Department  Experience  Gender
0      Sridevi  21.0  25000.0  Developer           1       0
1      Sathish  22.0  26000.0  Developer           2       1
2     Dhayalan  23.0      NaN  Developer           3       1
3         Teja  24.0  28000.0  Developer           4       1
4         Rani  25.0  29000.0  Developer           5       0
5       Sundar   NaN  30000.0  Developer           6       1
6        Deepa  27.0  31000.0  Developer           7       0
7  Jeyalakshmi  28.0  32000.0  Developer           8       0
8       Prince  29.0  33000.0        NaN           9       1
9      Shanker  30.0  34000.0  Developer          10       1

          Name    Age   Salary Department  Experience  Gender
0      Sridevi     21  25000.0  Developer           1  Female
1      Sathish     22  26000.0  Developer           2    Male
2     Dhayalan     23      NaN  Developer           3    Male
3         Teja     24  28000.0  Developer           4    Male
4         Rani     25  29000.0  Developer           5  Female
5       Sundar  Empty  30000.0  Developer           6    Male
6        Deepa     27  31000.0  Developer           7  Female
7  Jeyalakshmi     28  32000.0  Developer           8  Female
8       Prince     29  33000.0        NaN           9    Male
9      Shanker     30  34000.0  Developer          10    Male